3D_riblet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            patch;
        nFaces          1800;
        startFace       590112;
    }
    rightWall
    {
        type            patch;
        nFaces          1800;
        startFace       591912;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          12000;
        startFace       593712;
    }
    upperWall
    {
        type            patch;
        nFaces          8400;
        startFace       605712;
    }
    frontWall
    {
        type            patch;
        nFaces          2688;
        startFace       614112;
    }
    backWall
    {
        type            patch;
        nFaces          2688;
        startFace       616800;
    }
)

// ************************************************************************* //
